Revit 2020 API
BasePoint.SharedPosition Property
 Shared position of the BasePoint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2019.2
Syntax
C#
public XYZ SharedPosition { get; }
Visual Basic
Public ReadOnly Property SharedPosition As XYZ
	Get
Visual C++
public:
property XYZ^ SharedPosition {
	XYZ^ get ();
}
See Also
BasePoint Class
Autodesk.Revit.DB Namespace